//Дан двумерный целочисленный массив 5 на 5 элементов, заполненный статическими значениями в диапазоне от 3 до 7.
//Подсчитайте количество четных элементов во всем массиве.

//4, 3, 5, 5, 3,

//6, 7, 4, 4, 3,

//3, 3, 7, 3, 6,

//3, 4, 3, 7, 7,

//3, 5, 6, 3, 6,
using Tyuiu.MkhitaryanSG.Sprint4.Task3.V27.Lib;
class Program
{
    static void Main(string[] args)
    {
        Console.Title = "Спринт #4 | Выполнила: Мхитарян С. Г. | РППб-25-1";

        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* Спринт #4                                                                 *");
        Console.WriteLine("* Тема: Двумерные массивы. (статический ввод)                               *");
        Console.WriteLine("* Задание #3                                                                *");
        Console.WriteLine("* Вариант #27                                                               *");
        Console.WriteLine("* Выполнила: Мхитарян София Геворковна | РППб-25-1                          *");
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* УСЛОВИЕ:                                                                  *");
        Console.WriteLine("* Дан двумерный целочисленный массив 5 на 5 элементов,                      *");
        Console.WriteLine("* статическими значениями в диапазоне от 3 до 7.                            *");
        Console.WriteLine("* Подсчитайте количество четных элементов во всем массиве.                  *");
        Console.WriteLine("*****************************************************************************");

        int[,] mas2 = new int[5, 5] { { 4, 3, 5, 5, 3 },
                                       { 6, 7, 4, 4, 3 },
                                       { 3, 3, 7, 3, 6 },
                                       { 3, 4, 3, 7, 7 },
                                       { 3, 5, 6, 3, 6 } };

        int rows = mas2.GetLength(0); // Количество строк
        int columns = mas2.GetLength(1); // Количество столбцов

        DataService ds = new DataService();
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                           *");
        Console.WriteLine("*****************************************************************************");

        // Выводим массив
        for (int i = 0; i < rows; i++)
        {
            for (int j = 0; j < columns; j++)
            {
                Console.Write($"{mas2[i, j]} \t"); // Используем Console.Write для вывода в одной строке
            }
            Console.WriteLine();
        }

        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
        Console.WriteLine("***************************************************************************");

        int res = ds.Calculate(mas2);
        Console.WriteLine($"Количество четных элементов матрицы: {res}");
        Console.ReadKey();
    }
}