//Дан одномерный целочисленный массив на 10 элементов заполненный статическими значениями в диапазоне
//от 0 до 9 подсчитать сумму четных элементов массива. {6 ,4 ,3 ,2 ,1 ,0 ,9 ,8 ,7 ,5}
using Tyuiu.MkhitaryanSG.Sprint4.Task0.V1.Lib;
class Program
{
    static void Main(string[] args)
    {
        Console.Title = "Спринт #4 | Выполнила: Мхитарян С. Г. | РППб-25-1";

        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* Спринт #4                                                                 *");
        Console.WriteLine("* Тема: Одномерные массивы (статический ввод)                               *");
        Console.WriteLine("* Задание #0                                                                *");
        Console.WriteLine("* Вариант #1                                                                *");
        Console.WriteLine("* Выполнила: Мхитарян София Геворковна | РППб-25-1                          *");
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* УСЛОВИЕ:                                                                  *");
        Console.WriteLine("* Дан одномерный целочисленный массив на 10 элементов заполненный           *");
        Console.WriteLine("* статическими значениями в диапазоне от 0 до 9                             *");
        Console.WriteLine("* подсчитать сумму четных элементов массива. {6 ,4 ,3 ,2 ,1 ,0 ,9 ,8 ,7 ,5} *");
        Console.WriteLine("*****************************************************************************");

        DataService ds = new DataService();
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                           *");
        Console.WriteLine("*****************************************************************************");
        int[] nums = { 6, 4, 3, 2, 1, 0, 9, 8, 7, 5 };
        Console.WriteLine("Исходный массив:");
        for (int i = 0; i < nums.Length; i++)
        {
            Console.WriteLine(nums[i]);
        }

        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
        Console.WriteLine("***************************************************************************");

        // Получаем сумму четных элементов
        int sumOfEvens = ds.GetSumEvenArrEl(nums);
        Console.WriteLine($"Сумма четных элементов: {sumOfEvens}");

        Console.ReadKey();
    }
}