//Вариант 6
//Дан одномерный целочисленный массив на 15 элементов заполненный случайными в диапазоне
//от 2 до 8 подсчитать произведение нечетных элементов массива.
using Tyuiu.MkhitaryanSG.Sprint4.Task2.V6.Lib;
class Program
{
    static void Main(string[] args)
    {
        Console.Title = "Спринт #4 | Выполнила: Мхитарян С. Г. | РППб-25-1";

        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* Спринт #4                                                                 *");
        Console.WriteLine("* Тема: Одномерные массивы (генератор случайных чисел)                      *");
        Console.WriteLine("* Задание #2                                                                *");
        Console.WriteLine("* Вариант #6                                                                *");
        Console.WriteLine("* Выполнила: Мхитарян София Геворковна | РППб-25-1                          *");
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* УСЛОВИЕ:                                                                  *");
        Console.WriteLine("* Дан одномерный целочисленный массив на 15 элементов заполненный           *");
        Console.WriteLine("* статическими значениями в диапазоне от 2 до 8                             *");
        Console.WriteLine("* подсчитать произведение нечетных элементов массива.                       *");
        Console.WriteLine("*****************************************************************************");

        DataService ds = new DataService();
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                           *");
        Console.WriteLine("*****************************************************************************");

        int len = 15; // Установим фиксированное значение 15
        int[] nums = new int[len];
        Random random = new Random();

        // Заполняем массив случайными числами от 2 до 8
        for (int i = 0; i < len; i++)
        {
            nums[i] = random.Next(2, 9); // Генерация случайного числа от 2 до 8
        }

        Console.WriteLine();
        Console.WriteLine("Массив: ");
        for (int i = 0; i < len; i++)
        {
            Console.Write(nums[i] + "\t"); // Используем Console.Write для вывода в одной строке
        }

        Console.WriteLine();
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
        Console.WriteLine("***************************************************************************");

        // Получаем произведение нечетных элементов
        int res = ds.Calculate(nums);
        Console.WriteLine($"Произведение нечетных элементов: {res}");
        Console.ReadKey();
    }
}