//Дан двумерный целочисленный массив 5 на 5 элементов, заполненный значениями с клавиатуры в диапазоне от 1 до 8.
//Найдите сумму четных элементов массива.
//3, 7, 3, 1, 5,
//6, 3, 2, 1, 2,
//1, 3, 2, 8, 1,
//5, 8, 1, 5, 1,
//3, 3, 4, 4, 6,
using Tyuiu.MkhitaryanSG.Sprint4.Task4.V9.Lib;
class Program
{
    static void Main(string[] args)
    {
        Console.Title = "Спринт #4 | Выполнила: Мхитарян С. Г. | РППб-25-1";

        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* Спринт #4                                                                 *");
        Console.WriteLine("* Тема: Двумерные массивы. (статический ввод)                               *");
        Console.WriteLine("* Задание #4                                                                *");
        Console.WriteLine("* Вариант #9                                                                *");
        Console.WriteLine("* Выполнила: Мхитарян София Геворковна | РППб-25-1                          *");
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* УСЛОВИЕ:                                                                  *");
        Console.WriteLine("* Дан двумерный целочисленный массив 5 на 5 элементов,                      *");
        Console.WriteLine("* заполненный значениями с клавиатуры в диапазоне от 1 до 8.                *");
        Console.WriteLine("* Найдите сумму четных элементов массива.                                   *");
        Console.WriteLine("*****************************************************************************");

        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                           *");
        Console.WriteLine("*****************************************************************************");

        DataService ds = new DataService();
        int rows = 5; // Фиксированное количество строк
        int columns = 5; // Фиксированное количество столбцов
        int[,] mas2 = new int[rows, columns];

        Console.WriteLine("***************************************************************************");

        // Заполняем массив
        for (int i = 0; i < rows; i++)
        {
            for (int j = 0; j < columns; j++)
            {
                int inputValue;
                do
                {
                    Console.Write($"Введите элемент массива [{i}, {j}] (от 1 до 8): ");
                    inputValue = Convert.ToInt32(Console.ReadLine());
                } while (inputValue < 1 || inputValue > 8); // Проверка диапазона
                mas2[i, j] = inputValue;
            }
            Console.WriteLine();
        }

        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                           *");
        Console.WriteLine("***************************************************************************");

        // Выводим массив
        for (int i = 0; i < rows; i++)
        {
            for (int j = 0; j < columns; j++)
            {
                Console.Write($"{mas2[i, j]} \t"); // Используем Console.Write для вывода в одной строке
            }
            Console.WriteLine();
        }

        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
        Console.WriteLine("***************************************************************************");

        // Получаем сумму четных элементов
        int sum = ds.Calculate(mas2);
        Console.WriteLine($"Сумма четных элементов матрицы: {sum}");
        Console.ReadKey();
    }
}