//Дан двумерный целочисленный массив 5 на 5 элементов, заполненный случайными значениями в диапазоне от -8 до 9.
//Найти количество отрицательных элементов.
using Tyuiu.MkhitaryanSG.Sprint4.Task5.V22.Lib;
class Program
{
    static void Main(string[] args)
    {
        Console.Title = "Спринт #4 | Выполнила: Мхитарян С. Г. | РППб-25-1";

        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* Спринт #4                                                                 *");
        Console.WriteLine("* Тема: Двумерные массивы. (генератор случайных чисел)                      *");
        Console.WriteLine("* Задание #5                                                                *");
        Console.WriteLine("* Вариант #22                                                               *");
        Console.WriteLine("* Выполнила: Мхитарян София Геворковна | РППб-25-1                          *");
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* УСЛОВИЕ:                                                                  *");
        Console.WriteLine("* Дан двумерный целочисленный массив 5 на 5 элементов,                      *");
        Console.WriteLine("* заполненный случайными значениями в диапазоне от -8 до 9.                 *");
        Console.WriteLine("* Найти количество отрицательных элементов.                                 *");
        Console.WriteLine("*****************************************************************************");

        int[,] mas2 = new int[5, 5];
        Random rand = new Random();

        // Заполняем массив случайными числами от -8 до 9
        for (int i = 0; i < 5; i++)
        {
            for (int j = 0; j < 5; j++)
            {
                mas2[i, j] = rand.Next(-8, 10); // Генерация случайного числа от -8 до 9
            }
        }

        int rows = mas2.GetLength(0); // Количество строк
        int columns = mas2.GetLength(1); // Количество столбцов

        DataService ds = new DataService();
        Console.WriteLine("*****************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ                                                           *");
        Console.WriteLine("*****************************************************************************");

        // Выводим массив
        for (int i = 0; i < rows; i++)
        {
            for (int j = 0; j < columns; j++)
            {
                Console.Write($"{mas2[i, j]} \t"); // Используем Console.Write для вывода в одной строке
            }
            Console.WriteLine();
        }

        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
        Console.WriteLine("***************************************************************************");

        int res = ds.Calculate(mas2);
        Console.WriteLine($"Количество отрицательных элементов матрицы: {res}");
        Console.ReadKey();
    }
}